Revit 2024 API
InsulationLiningBase.GetLiningIds Method
 Returns the ids of the lining elements associated to a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static ICollection<ElementId> GetLiningIds(
	Document document,
	ElementId elemId
)
Visual Basic
Public Shared Function GetLiningIds ( _
	document As Document, _
	elemId As ElementId _
) As ICollection(Of ElementId)
Visual C++
public:
static ICollection<ElementId^>^ GetLiningIds(
	Document^ document,
	ElementId^ elemId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
elemId
Type: Autodesk.Revit.DB.ElementId
 The element.
Return Value
 A collection of the ids of the lining elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  This id does not represent a duct, fitting, or accessory element.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
InsulationLiningBase Class
Autodesk.Revit.DB Namespace